# A4
###### Konfigurisanje VLAN-ova

Recept:
- 2 switcha
- 30 ucenicka racunara
- 2 profesorska racunara
- 8 racunara za upravu

Radi se sa 2 ucionice (svaki switch za sebe), koje su medjusobno povezane.
Ta dva switcha su medjusobno povezana cross-over kablom jer zbog zato sto su
istorodni uredjaji. (u vezbi ne pise preko kog porta ih treba povezati.)

##### Outline vezbe
Profesori su na zajednickom vlanu (2), ucenici na zajednickom (3), uprava na (4):

- dodaj sifre na switchu (console, vty, enable)
- dodeli IP adrese za racunare (rucno)
- dodeli IP adrese za VLAN na switchevima (_ne zaboravi no sh!_)
- promeni hostname na switchu
- napravi VLAN-ove
- baci svakog na svoj VLAN ```interface range fa 0/22-24 (selektuje od 22-og
  do 24-tog porta)```
- pogasi sve portove van upotrebe

***
Podesavanje hostname-a

    Switch>enable
    Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
    Switch(config)#hostname SW2
*** 
Postavljanje sifara

    SW2(config)#enable secret skolagodina
    SW2(config)#line console 0
    SW2(config-line)#password skolagodina
    SW2(config-line)#login
    SW2(config-line)#exit
    SW2(config)#line vty 0 15
    SW2(config-line)#password skolagodina
    SW2(config-line)#login
    SW2(config-line)#exit
***
Postavljanje adrese za telnet

    SW2(config)#interface vlan 1
    SW2(config-if)#ip address 172.17.100.2 255.255.128.0
    SW2(config-if)#no shutdown
    SW2(config-if)#exit
***
Pravljenje vlan-ova

    SW2(config)#vlan 2
    SW2(config-vlan)#name profesori
    SW2(config-vlan)#exit
    SW2(config)#vlan 3
    SW2(config-vlan)#name ucenici
    SW2(config-vlan)#exit
    SW2(config)#vlan 4
    SW2(config-vlan)#name uprava
    SW2(config-vlan)#exit 
***
Ubacivanje racunara u vlan-ove

    SW2(config)#interface fa0/1
    SW2(config-if)#switchport mode access
    SW2(config-if)#switchport access vlan 2
    SW2(config-if)#exit
    SW2(config)#interface range fa0/2-16
    SW2(config-if-range)#switchport mode access
    SW2(config-if-range)#switchport access vlan 3
    SW2(config-if-range)#exit
    SW2(config)#interface range fa0/17-20
    SW2(config-if-range)#switchport mode access
    SW2(config-if-range)#switchport access vlan 4
    SW2(config-if-range)#exit
    SW2(config)#interface fa0/21
    SW2(config-if)#switchport mode trunk
    SW2(config-if)#exit
***
Iskljucivanje nepotrebnih portova

    SW2(config)#interface range fa0/22-24
    SW2(config-if-range)#shutdown
    SW2(config-if-range)#exit
    SW2(config)#copy run start
